<?php


namespace Core;


class Config
{
	/***********************************************************
	 * ВКЛЮЧЕНИЕ/ОТКЛЮЧЕНИЕ БОТА
	 ***********************************************************/

	/**
	 * Включение/отключение системы бота в целом
	 * @var boolean
	 */
	public const BOT_SYSTEM_ONLINE = true;

	/**
	 * Включение/отключение выполнения команд ботом
	 * @var boolean
	 */
	public const BOT_ONLINE = true;


	/***********************************************************
	 * НАСТРОЙКА РЕЖИМА ОТЛАДКИ И ВЫВОДА ОШИБОК
	 ***********************************************************/

	/**
	 * Включение/отключение режима отладки
	 * @var boolean
	 */
	public const DEBUG_ON = true;

	/**
	 * Задает, какие ошибки PHP попадут в отчет
	 * см. https://www.php.net/manual/en/function.error-reporting.php
	 */
	public const ERROR_REPORTING_LEVEL = E_ALL;


	/***********************************************************
	 * НАСТРОЙКА ЛОГИРОВАНИЯ ОШИБОК
	 ***********************************************************/

	/**
	 * Логирование ошибок в определённый файл или системный журнал
	 * true - логирование ошибок будет осуществляться в указанной в static::ERRORS_LOG_FILE_DIRECTORY директории
	 * false - системный файл ошибок
	 */
	public const LOG_ERRORS_TO_FILE = false;

	/**
	 * Каталог, в котором будут создаваться файлы с логами ошибок
	 * Указывать абсолютный путь + "/" на конце
	 */
	public const ERRORS_LOG_FILE_DIRECTORY = '';


	/***********************************************************
	 * НАСТРОЙКА ПОДКЛЮЧЕНИЯ К БАЗЕ ДАННЫХ
	 ***********************************************************/

	/**
	 * Хост базы данных
	 */
	public const DB_HOST = '';

	/**
	 * Название базы данных
	 */
	public const DB_NAME = '';

	/**
	 * Пользователь базы данных
	 */
	public const DB_USER = '';

	/**
	 * Пароль пользователя базы данных
	 */
	public const DB_PASS = '';

	/**
	 * Кодировка базы данных
	 */
	public const DB_CHARSET = 'utf8';

	/**
	 * Префикс таблиц в базе данных
	 */
	public const DB_PREFIX = '';


	/***********************************************************
	 * НАСТРОЙКА ПОДКЛЮЧЕНИЯ К VK API
	 ***********************************************************/

	/**
	 * Хранит данные обо всех сообществах, которые имеют доступ к боту
	 * @var array
	 */
	public const VK_GROUPS = array (
		'id186813513' => array (
			'confirmation_token' => '',
			'access_token' => '',
			'secret_key'   => ''
		),
		'id61281268' => array (
			'confirmation_token' => '',
			'access_token' => '',
			'secret_key'   => ''
		)
	);

	/**
	 * Версия VK API по умолчанию
	 * @var string
	 */
	public const VK_API_DEFAULT_VERSION = '5.101';


	/***********************************************************
	 * НАСТРОЙКА ПОДКЛЮЧЕНИЯ К TELEGRAM API
	 ***********************************************************/

	/**
	 * Токен доступа к функциям бота, выданный Telegram
	 * @var string
	 */
	public const TELEGRAM_API_ACCESS_TOKEN = '';

	/**
	 * Прокси сервер для подключения к Telegram
	 * @var string
	 */
	public const TELEGRAM_PROXY_SERVER = '';

	/**
	 * Порт прокси сервера для подключения к Telegram
	 * @var integer
	 */
	public const TELEGRAM_PROXY_PORT = '';

	/**
	 * Пользователь прокси (для авторизации)
	 * @var string
	 */
	public const TELEGRAM_PROXY_USER = '';

	/**
	 * Пароль пользователя прокси (для авторизации)
	 * @var string
	 */
	public const TELEGRAM_PROXY_PASSWORD = '';


	/***********************************************************
	 * НАСТРОЙКА АДМИНИСТРАТОРОВ
	 ***********************************************************/

	/**
	 * Список администраторов бота
	 * - Из ВК:       peerID-<peerID>; Например: peerID-123456789
	 * - Из Telegram: chatID-<chatID>; Например: chatID-123456789
	 * @var array
	 */
	public const ADMIN_USERS = array (
		'peerID-222734159'
	);
}